_Rarzrabotki/Rarus/USO2/ExchangePlans/СМ_WS_Обмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ExchangePlan>
		<Properties>
			<Name>СМ_WS_Обмен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОбъектыСтроительства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКонтрагентовИДоговоры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦеныРесурсов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАкты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыРесурсов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРесурса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_WS_БуферЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_WS_БуферЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеОбъекта1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧисловойПараметр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUIDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_WS_СоответствиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_WS_СоответствиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GUIDОбъектаТекущейбазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_НормативныеСборники</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЗаявкаНаМатериал</v8:Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/ExchangePlans/СМ_WS_Обмен/Forms/ФормаСопоставлениеОбъектов/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчика;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДекорацияСостояние.Заголовок="Состояние: ожидание запроса данных";
	ОчиститьБуферНаСервере(Объект.Код);
	ТипОбъекта="OrgList";
	УстановитьОтбор();
	УстановитьОтборСопоставленные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОчиститьБуферНаСервере(Объект.Код);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	Если ТипОбъекта="OrgList" Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаОрганизация;
		Элементы.РесурсыСопоставитьВсеПоКоду.Видимость=Ложь;
		
	ИначеЕсли ТипОбъекта="PartnerList" Тогда	
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаКонтрагенты;
		Элементы.РесурсыСопоставитьВсеПоКоду.Видимость=Истина;
	ИначеЕсли ТипОбъекта="ContractList" Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаДоговоры;
		Элементы.РесурсыСопоставитьВсеПоКоду.Видимость=Ложь;
		
	ИначеЕсли ТипОбъекта="BuildList" Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаОбъектыСтроительства;
		Элементы.РесурсыСопоставитьВсеПоКоду.Видимость=Ложь;
		
	ИначеЕсли ТипОбъекта="AssetsList" Тогда	
		Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаРесурсы;
		Элементы.РесурсыСопоставитьВсеПоКоду.Видимость=Истина;
	КонецЕсли;
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСопоставленныеПриИзменении(Элемент)
	
	УстановитьОтборСопоставленные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапроситьДанные(Команда)
	СТ=Новый  Структура;
	СТ.Вставить("URL", Объект.URL);
	СТ.Вставить("Логин",Объект.Пользователь);
	СТ.Вставить("Пароль",Объект.Пароль);
	СТ.Вставить("ТипОбъекта",ТипОбъекта);
	СТ.Вставить("ИдентификаторБазы",Объект.Код);
	СТ.Вставить("Узел",Объект.Ссылка);
	Элементы.ДекорацияСостояние.Заголовок="Состояние: ожидание ответа от веб-сервиса";
	Элементы.ФормаЗапроситьДанные.Доступность=Ложь;
	ФоновоеЗадание=Ложь;
	ЗапроситьДанныеНаСервере(СТ,ФоновоеЗадание);
	Если ФоновоеЗадание Тогда
	ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", 1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъект(Команда)
	СоздатьОбъектНаСервере(Элементы.СписокОбъектов.ТекущиеДанные.GUID);
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьОбъект(Команда)
		СТ=Новый Структура;
		ТипДляСопоставления="";
	
	Если ТипОбъекта="OrgList" Тогда
		Если  Элементы.Организации.ТекущиеДанные=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ст.Вставить("Объект",Элементы.Организации.ТекущиеДанные.Ссылка);
		ТипДляСопоставления="СправочникСсылка.Организации";

	ИначеЕсли ТипОбъекта="PartnerList" Тогда	
		Если  Элементы.Контрагенты.ТекущиеДанные=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ст.Вставить("Объект",Элементы.Контрагенты.ТекущиеДанные.Ссылка);
		ТипДляСопоставления="СправочникСсылка.Контрагенты";

	ИначеЕсли ТипОбъекта="ContractList" Тогда
		Если  Элементы.ДоговорыКонтрагентов.ТекущиеДанные=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ст.Вставить("Объект",Элементы.ДоговорыКонтрагентов.ТекущиеДанные.Ссылка);
		ТипДляСопоставления="СправочникСсылка.ДоговорыКонтрагентов";

	ИначеЕсли ТипОбъекта="BuildList" Тогда
		Если  Элементы.ОбъектыСтроительства.ТекущиеДанные=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ст.Вставить("Объект",Элементы.ОбъектыСтроительства.ТекущиеДанные.Ссылка);
		ТипДляСопоставления="СправочникСсылка.ОбъектыСтроительства";

	ИначеЕсли ТипОбъекта="AssetsList" Тогда	
		Если  Элементы.Ресурсы.ТекущиеДанные=Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ст.Вставить("Объект",Элементы.Ресурсы.ТекущиеДанные.Ссылка);
		ТипДляСопоставления="СправочникСсылка.СМ_Ресурсы";


	Иначе Возврат;
	КонецЕсли;

	Если Элементы.СписокОбъектов.ТекущиеДанные=Неопределено Тогда
		Возврат;
	КОнецЕсли;
	
	Ст.Вставить("ИдентификаторБазы",Объект.Код);
	Ст.Вставить("ТипОбъекта",ТипДляСопоставления);
	Ст.Вставить("GUID",Элементы.СписокОбъектов.ТекущиеДанные.GUID);

	СопоставитьОбъектНаСервере(Ст);
	Элементы.СписокОбъектов.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПривязку(Команда)
	СТ=Новый Структура;
	Ст.Вставить("ИдентификаторБазы",Объект.Код);
	Ст.Вставить("GUID",Элементы.СписокОбъектов.ТекущиеДанные.GUID);
	Ст.Вставить("Объект",Элементы.СписокОбъектов.ТекущиеДанные.Объект);

	УдалитьНаСервере(Ст);
	Элементы.СписокОбъектов.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьВсеПоКоду(Команда)
	Если ТипОбъекта="AssetsList" Тогда
	СопоставитьРесурсыПоКодуНаСервере();
	ИначеЕсли ТипОбъекта="PartnerList" Тогда
	СопоставитьКонтрагентовПоКодуНаСервере();
КонецЕсли;
Элементы.СписокОбъектов.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОчиститьБуферНаСервере(ИдентификаторБазы)
	
	Набор = РегистрыСведений.СМ_WS_БуферЗагрузки.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторБазы.Установить(ИдентификаторБазы); 
	//Набор.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	Набор.Отбор.Пользователь.Установить(ПользователиКлиентСервер.ТекущийПользователь());
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗапроситьДанныеНаСервере(Данные,ФоновоеЗадание)
	
	//Данные.Вставить("ТекущийПользователь",ПараметрыСеанса.ТекущийПользователь);
	Данные.Вставить("ТекущийПользователь",ПользователиКлиентСервер.ТекущийПользователь());
	Адрем="";
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"ПланыОбмена.СМ_WS_Обмен.ЗапроситьДанныеССервиса",
	Данные, 
	НСтр("ru = 'Получение данных с сервиса'"));
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		Элементы.ФормаЗапроситьДанные.Доступность=Истина;
		ЗавершениеФоновогоЗадания();
	Иначе
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		ФоновоеЗадание=Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузка()
	РезультатФоновогоЗадания = ФоновоеЗаданиеПолучитьРезультат();
	Если РезультатФоновогоЗадания.ФоновоеЗаданиеВыполнено Тогда
		ЗавершениеФоновогоЗадания();
		Элементы.ФормаЗапроситьДанные.Доступность=Истина;
	Иначе
		Элементы.ДекорацияСостояние.Заголовок="Состояние: загрузка данных "+РезультатФоновогоЗадания.Прогресс;
		Элементы.СписокОбъектов.Обновить();
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", 5, Истина);
	КонецЕсли;
КонецПроцедуры     

&НаСервере
Функция ФоновоеЗаданиеПолучитьРезультат()
	Прогресс=ДлительныеОперации.ПрочитатьПрогресс(ФоновоеЗаданиеИдентификатор);
	Выполнено=ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	Возврат Новый Структура("Прогресс,ФоновоеЗаданиеВыполнено",Прогресс,Выполнено);
КонецФункции

&НаСервере
Процедура ЗавершениеФоновогоЗадания()
		Данные = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		Элементы.ДекорацияСостояние.Заголовок="Состояние: "+Данные.Текст;
КонецПроцедуры

&НаСервере
Процедура СопоставитьОбъектНаСервере(Ст)
Запись=РегистрыСведений.СМ_WS_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
ЗаполнитьЗначенияСвойств(Запись,Ст);
Запись.Дата=ТекущаяДата();
Запись.GUIDОбъектаТекущейбазы=Ст.Объект.УникальныйИдентификатор();
Запись.Записать();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСопоставленные()
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокОбъектов, "Сопоставлен", Ложь,,,НЕ ПоказыватьСопоставленные);
КонецПроцедуры
		
&НаСервере
Процедура УстановитьОтбор()
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокОбъектов, "ТипОбъекта", ТипОбъекта,,,Истина);
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектНаСервере(GUID)
СМ_WS_ВызовСервера.СоздатьЭлементСправочника(Объект.Ссылка,GUID,ТипОбъекта);	
Элементы.СписокОбъектов.Обновить();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(Ст)

Запись=РегистрыСведений.СМ_WS_СоответствиеОбъектов.СоздатьМенеджерЗаписи();
ЗаполнитьЗначенияСвойств(Запись,Ст);
Запись.Прочитать();
Запись.Удалить();
КонецПроцедуры

&НаСервере
Процедура СопоставитьРесурсыПоКодуНаСервере()

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	СМ_WS_БуферЗагрузки.GUID,
                    |	СМ_WS_БуферЗагрузки.ПредставлениеОбъекта1,
                    |	СМ_WS_СоответствиеОбъектов.Объект,
                    |	СМ_Ресурсы.Ссылка
                    |ИЗ
                    |	РегистрСведений.СМ_WS_БуферЗагрузки КАК СМ_WS_БуферЗагрузки
                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_WS_СоответствиеОбъектов КАК СМ_WS_СоответствиеОбъектов
                    |		ПО (СМ_WS_БуферЗагрузки.ИдентификаторБазы = &ИдентификаторБазы)
                    |			И СМ_WS_БуферЗагрузки.GUID = СМ_WS_СоответствиеОбъектов.GUID
                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СМ_Ресурсы КАК СМ_Ресурсы
                    |		ПО СМ_WS_БуферЗагрузки.ПредставлениеОбъекта1 = СМ_Ресурсы.Код
                    |ГДЕ
                    |	СМ_WS_БуферЗагрузки.Пользователь = &Пользователь
                    |	И СМ_WS_БуферЗагрузки.ИдентификаторБазы = &ИдентификаторБазы
                    |	И СМ_WS_БуферЗагрузки.ТипОбъекта = ""AssetsList""
                    |	И СМ_WS_СоответствиеОбъектов.Объект ЕСТЬ NULL 
                    |	И НЕ СМ_Ресурсы.Ссылка ЕСТЬ NULL ");
 Запрос.УстановитьПараметр("ИдентификаторБазы",Объект.Код);					
 //Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
 Запрос.УстановитьПараметр("Пользователь",ПользователиКлиентСервер.ТекущийПользователь());

 Рез=Запрос.Выполнить().Выбрать();
 
 СТ=Новый Структура;
 Ст.Вставить("Объект","");
 Ст.Вставить("ИдентификаторБазы",Объект.Код);
 Ст.Вставить("ТипОбъекта","СправочникСсылка.СМ_Ресурсы");
 Ст.Вставить("GUID","");

 Пока Рез.Следующий() Цикл
	Ст.Объект=Рез.Ссылка;
	Ст.GUID=Рез.GUID;
	СопоставитьОбъектНаСервере(Ст); 
 КонецЦикла;
 
	  
КонецПроцедуры

&НаСервере
Процедура СопоставитьКонтрагентовПоКодуНаСервере()

Запрос=Новый Запрос("ВЫБРАТЬ
                    |	СМ_WS_БуферЗагрузки.GUID,
                    |	СМ_WS_БуферЗагрузки.ПредставлениеОбъекта1,
                    |	СМ_WS_СоответствиеОбъектов.Объект,
                    |	Контрагенты.Ссылка
                    |ИЗ
                    |	РегистрСведений.СМ_WS_БуферЗагрузки КАК СМ_WS_БуферЗагрузки
                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_WS_СоответствиеОбъектов КАК СМ_WS_СоответствиеОбъектов
                    |		ПО (СМ_WS_БуферЗагрузки.ИдентификаторБазы = &ИдентификаторБазы)
                    |			И СМ_WS_БуферЗагрузки.GUID = СМ_WS_СоответствиеОбъектов.GUID
                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
                    |		ПО СМ_WS_БуферЗагрузки.ПредставлениеОбъекта1 = Контрагенты.ИНН
                    |ГДЕ
                    |	СМ_WS_БуферЗагрузки.Пользователь = &Пользователь
                    |	И СМ_WS_БуферЗагрузки.ИдентификаторБазы = &ИдентификаторБазы
                    |	И СМ_WS_БуферЗагрузки.ТипОбъекта = ""PartnerList""
                    |	И СМ_WS_СоответствиеОбъектов.Объект ЕСТЬ NULL 
                    |	И НЕ Контрагенты.Ссылка ЕСТЬ NULL ");
 Запрос.УстановитьПараметр("ИдентификаторБазы",Объект.Код);					
 //Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
 Запрос.УстановитьПараметр("Пользователь",ПользователиКлиентСервер.ТекущийПользователь());

 Рез=Запрос.Выполнить().Выбрать();
 
 СТ=Новый Структура;
 Ст.Вставить("Объект","");
 Ст.Вставить("ИдентификаторБазы",Объект.Код);
 Ст.Вставить("ТипОбъекта","СправочникСсылка.Контрагенты");
 Ст.Вставить("GUID","");

 Пока Рез.Следующий() Цикл
	Ст.Объект=Рез.Ссылка;
	Ст.GUID=Рез.GUID;
	СопоставитьОбъектНаСервере(Ст); 
 КонецЦикла;
 
	  
КонецПроцедуры

#КонецОбласти
